#include <stdio.h>
/*当一个值超过一个数据类型能够存放的最大范围时,数值会溢出
 *有符号溢出和最高位溢出两种:
 	数值溢出,但是补码长度没有超过原数据类型长度会产生符号位溢出, 即数据的正负发生变化
	最高位溢出,数值的补码长度超过了原数据类型的长度, 最高位直接丢失
 */ 

int main()
{
	char ch;
	// char 1字节 -128 到 127 (-2)
	// 符号位溢出, 导致符号发生改变, 数值的绝对值也可能发生改变
	ch = 127 + 2;
	printf("%d\n", ch);
	// 127 + 2 == 0111 1111 + 2 = 1000 0001 , 负数补码, 转化为原码为 1111 1111, 十进制结果为 -127
	
	unsigned char ch2;
	// 最高位溢出导致最高位丢失
	ch2 = 255 + 1;
	printf("%u\n", ch2);
	// 255 + 1 == 1111 1111 + 1 = 0001 0000 0000, char只有8位,丢失最高位为 0000 0000 , 十进制结果为 0 
	
	ch2 = 255 + 2;
	printf("%u\n", ch2);
	// 255 + 1 == 1111 1111 + 2 = 0001 0000 0001 , char只有8位,丢失最高位为 0000 0001, 十进制结果为 1
	
	return 0;
}
